In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [3]:
obj = Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
obj.values

array([ 4,  7, -5,  3])

In [9]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [10]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [11]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2['a']

-5

In [13]:
obj2['d'] = 6

In [18]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [19]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [20]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [21]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [22]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [23]:
'b' in obj2

True

In [24]:
3 in obj2

False

In [25]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [26]:
obj3 = Series(sdata)

In [27]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [28]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [32]:
obj4 = Series(sdata, index=states)

In [33]:
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [34]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [35]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [36]:
obj3 + obj4

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [37]:
obj4.name = 'population'

In [38]:
obj4.index.name = 'state'

In [39]:
obj4

state
California      NaN
Ohio          35000
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [40]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [41]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [48]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [49]:
frame = DataFrame(data)

In [47]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [52]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [53]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop'], index=['one', 'two', 'three', 'four', 'five'])

In [54]:
frame2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [55]:
frame2.columns

Index([u'year', u'state', u'pop'], dtype='object')

In [56]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [58]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [64]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
Name: three, dtype: object

In [65]:
frame2['debt'] = 16.5

In [66]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [67]:
frame2['debt'] = np.arange(5.)

In [68]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [69]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [70]:
frame2['debt'] = val

In [71]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [72]:
frame2['estern'] = frame2.state == 'Ohio'

In [73]:
frame2

       year   state  pop  debt estern
one    2000    Ohio  1.5   NaN   True
two    2001    Ohio  1.7  -1.2   True
three  2002    Ohio  3.6   NaN   True
four   2001  Nevada  2.4  -1.5  False
five   2002  Nevada  2.9  -1.7  False

In [74]:
del frame2['estern']

In [75]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [76]:
frame2.index

Index([u'one', u'two', u'three', u'four', u'five'], dtype='object')

In [77]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [78]:
frame3 = DataFrame(pop)

In [79]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [80]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [81]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [84]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][1:]}

In [85]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   NaN

In [86]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [87]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [88]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [256]:
obj = Series(range(3), index=['a', 'b', 'c'])

In [257]:
index =obj.index

In [258]:
index

Index([u'a', u'b', u'c'], dtype='object')

In [259]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [260]:
index[1] = 'd'

TypeError: Indexes does not support mutable operations

In [261]:
index = pd.Index(np.arange(3))

In [262]:
obj2 = Series([1.5, -2.5, 0], index=index)

In [263]:
obj2.index

Int64Index([0, 1, 2], dtype='int64')

In [264]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [265]:
'Ohio' in frame3.columns

True

In [266]:
2003 in frame3.index

False

In [267]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [268]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [269]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [270]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [271]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [273]:
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [274]:
frame = DataFrame(np.arange(9).reshape(3, 3), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'Califorlia'])

In [275]:
frame

   Ohio  Texas  Califorlia
a     0      1           2
c     3      4           5
d     6      7           8

In [278]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [279]:
frame2

   Ohio  Texas  Califorlia
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [280]:
states = ['Texas', 'Utah', 'Califorlia']

In [281]:
frame.reindex(columns=states)

   Texas  Utah  Califorlia
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [286]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill', columns=states)

   Texas  Utah  Califorlia
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [287]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  Califorlia
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

In [288]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [289]:
new_obj = obj.drop('c')

In [290]:
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [291]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: float64

In [292]:
data = DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [293]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [294]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [297]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [298]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [299]:
obj['b']

1.0

In [300]:
obj[1]

1.0

In [301]:
obj[2:4]

c    2
d    3
dtype: float64

In [302]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: float64

In [303]:
obj[[1, 3]]

b    1
d    3
dtype: float64

In [304]:
obj[obj < 2]

a    0
b    1
dtype: float64

In [305]:
obj['b':'c']

b    1
c    2
dtype: float64

In [306]:
obj['b':'c'] = 5

In [307]:
obj

a    0
b    5
c    5
d    3
dtype: float64

In [308]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                index=['Ohio', 'Colorado', 'Utah', 'New York'],
                columns=['one', 'two', 'three', 'four'])

In [309]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [312]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int64

In [317]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [318]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [319]:
data[data < 5] = 0

In [320]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [321]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [322]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [323]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [324]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [325]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [326]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [327]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [331]:
s2= Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f','g'])

In [332]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [333]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [334]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [335]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [336]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [337]:
df1 + df2

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [338]:
df1.add(df2, fill_value=0)

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [339]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [340]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [341]:
arr = np.arange(12.).reshape((3, 4))

In [342]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [343]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [344]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [345]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [346]:
series = frame.ix[0]

In [347]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [348]:
series

b    0
d    1
e    2
Name: Utah, dtype: float64

In [349]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [350]:
series2 = Series(range(3), index=['b','e', 'f'])

In [351]:
frame + series2

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [352]:
series3 = frame['d']

In [353]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [354]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: float64

In [356]:
frame.sub(series3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [365]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [366]:
frame

               b         d         e
Utah    0.274992  0.228913  1.352917
Ohio    0.886429 -2.001637 -0.371843
Texas   1.669025 -0.438570 -0.539741
Oregon  0.476985  3.248944 -1.021228

In [367]:
np.abs(frame)

               b         d         e
Utah    0.274992  0.228913  1.352917
Ohio    0.886429  2.001637  0.371843
Texas   1.669025  0.438570  0.539741
Oregon  0.476985  3.248944  1.021228

In [368]:
f = lambda x: x.max() - x.min()

In [369]:
frame.apply(f)

b    1.394034
d    5.250581
e    2.374144
dtype: float64

In [370]:
frame.apply(f, axis=0)

b    1.394034
d    5.250581
e    2.374144
dtype: float64

In [371]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [372]:
frame.apply(f)

            b         d         e
min  0.274992 -2.001637 -1.021228
max  1.669025  3.248944  1.352917

In [373]:
format = lambda x: '%.2f' % x

In [374]:
frame.applymap(format)

           b      d      e
Utah    0.27   0.23   1.35
Ohio    0.89  -2.00  -0.37
Texas   1.67  -0.44  -0.54
Oregon  0.48   3.25  -1.02

In [375]:
frame['e'].map(format)

Utah       1.35
Ohio      -0.37
Texas     -0.54
Oregon    -1.02
Name: e, dtype: object

In [376]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [377]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [378]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])

In [380]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [381]:
frame.sort_index(1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [382]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [383]:
obj = Series([4, 7, -3, 2])

In [384]:
obj.order()

2   -3
3    2
0    4
1    7
dtype: int64

In [385]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [386]:
obj.order()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [387]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [388]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [389]:
frame.sort_index(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [390]:
frame.sort_index(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [391]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [392]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [393]:
obj.rank(method='first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [394]:
obj.rank(ascending=False, method='max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [395]:
frame = DataFrame({'b': [4.3, 7, 3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

In [396]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0  3.0  8.0
3  1  2.0 -2.5

In [397]:
frame.rank(axis=1)

   a  b  c
0  2  3  1
1  1  3  2
2  1  2  3
3  2  3  1

In [398]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [399]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [400]:
obj.index.is_unique

False

In [401]:
obj['a']

a    0
a    1
dtype: int64

In [402]:
obj['c']

4

In [403]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [404]:
df

          0         1         2
a -0.577087  0.124121  0.302614
a  0.523772  0.000940  1.343810
b -0.713544 -0.831154 -2.370232
b -1.860761 -0.860757  0.560145

In [405]:
df.ix['b']

          0         1         2
b -0.713544 -0.831154 -2.370232
b -1.860761 -0.860757  0.560145

In [407]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])

In [408]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [409]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [410]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [411]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [412]:
df.idxmax()

one    b
two    d
dtype: object

In [413]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [414]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [415]:
obj = Series(['a', 'a', 'b', 'c'] * 4)

In [416]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [417]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [419]:
obj.unique()

array(['a', 'b', 'c'], dtype=object)

In [421]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [422]:
uniques = obj.unique()

In [423]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [424]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [425]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [426]:
mask = obj.isin(['b', 'c'])

In [427]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [428]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [431]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [432]:
result = data.apply(pd.value_counts).fillna(0)

In [433]:
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

In [434]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [435]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [436]:
string_data[0] = None

In [437]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [438]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])

In [439]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [440]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [441]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [442]:
cleaned

   0    1  2
0  1  6.5  3

In [443]:
data.dropna(how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [444]:
data[4] = NA

In [445]:
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [446]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [447]:
df = DataFrame(np.random.randn(7, 3))

In [448]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA

In [449]:
df

          0         1         2
0 -1.265934       NaN       NaN
1  0.332883       NaN       NaN
2 -1.541996       NaN       NaN
3  0.286350       NaN -0.753887
4  0.331286       NaN  0.069877
5  0.246674 -0.011862  1.004812
6  1.327195 -0.919262 -1.549106

In [450]:
df.dropna(thresh=3)

          0         1         2
5  0.246674 -0.011862  1.004812
6  1.327195 -0.919262 -1.549106

In [451]:
df.fillna(0)

          0         1         2
0 -1.265934  0.000000  0.000000
1  0.332883  0.000000  0.000000
2 -1.541996  0.000000  0.000000
3  0.286350  0.000000 -0.753887
4  0.331286  0.000000  0.069877
5  0.246674 -0.011862  1.004812
6  1.327195 -0.919262 -1.549106

In [452]:
df.fillna({1: 0.5, 2:1.2})

          0         1         2
0 -1.265934  0.500000  1.200000
1  0.332883  0.500000  1.200000
2 -1.541996  0.500000  1.200000
3  0.286350  0.500000 -0.753887
4  0.331286  0.500000  0.069877
5  0.246674 -0.011862  1.004812
6  1.327195 -0.919262 -1.549106

In [453]:
df = DataFrame(np.random.randn(6, 3))

In [454]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA

In [455]:
df

          0         1         2
0  0.022185  0.758363 -0.660524
1  0.862580 -0.010032  0.050009
2  0.670216       NaN -0.955869
3 -0.023493       NaN -0.652469
4 -1.218302       NaN       NaN
5  0.723642       NaN       NaN

In [456]:
df.fillna(method='ffill')

          0         1         2
0  0.022185  0.758363 -0.660524
1  0.862580 -0.010032  0.050009
2  0.670216 -0.010032 -0.955869
3 -0.023493 -0.010032 -0.652469
4 -1.218302 -0.010032 -0.652469
5  0.723642 -0.010032 -0.652469

In [457]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.022185  0.758363 -0.660524
1  0.862580 -0.010032  0.050009
2  0.670216 -0.010032 -0.955869
3 -0.023493 -0.010032 -0.652469
4 -1.218302       NaN -0.652469
5  0.723642       NaN -0.652469

In [458]:
data = Series([1., NA, 3.5, NA, 7])

In [459]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [460]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -0.503087
   2   -0.622274
   3   -0.921169
b  1   -0.726213
   2    0.222896
   3    0.051316
c  1   -1.157719
   2    0.816707
d  2    0.433610
   3    1.010737
dtype: float64

In [466]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [467]:
data['b': 'c']

b  1   -0.726213
   2    0.222896
   3    0.051316
c  1   -1.157719
   2    0.816707
dtype: float64

In [468]:
data.ix[['b', 'd']]

b  1   -0.726213
   2    0.222896
   3    0.051316
d  2    0.433610
   3    1.010737
dtype: float64

In [473]:
data

a  1   -0.503087
   2   -0.622274
   3   -0.921169
b  1   -0.726213
   2    0.222896
   3    0.051316
c  1   -1.157719
   2    0.816707
d  2    0.433610
   3    1.010737
dtype: float64

In [474]:
data.unstack()

          1         2         3
a -0.503087 -0.622274 -0.921169
b -0.726213  0.222896  0.051316
c -1.157719  0.816707       NaN
d       NaN  0.433610  1.010737

In [475]:
data.unstack().stack()

a  1   -0.503087
   2   -0.622274
   3   -0.921169
b  1   -0.726213
   2    0.222896
   3    0.051316
c  1   -1.157719
   2    0.816707
d  2    0.433610
   3    1.010737
dtype: float64

In [477]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [478]:
frame.index.names = ['key1', 'key2']

In [479]:
frame.columns.names = ['state', 'color']

In [480]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [482]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [484]:
frame['Ohio', 'Green']

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (Ohio, Green), dtype: int64

In [487]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [495]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [496]:
frame.swaplevel(0, 1).sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [491]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [497]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [498]:
frame2 = frame.set_index(['c', 'd'])

In [499]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [500]:
frame.set_index(['c','d'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [505]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [506]:
ser = Series(np.arange(3.))

In [509]:
ser

0    0
1    1
2    2
dtype: float64

In [510]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])

In [511]:
ser2[-1]

2.0

In [512]:
ser2

a    0
b    1
c    2
dtype: float64

In [520]:
ser.ix[1]

1.0

In [521]:
ser3 = Series(range(3), index=[-5, 1, 3])

In [526]:
ser3.iget_value(0)

0

In [527]:
ser3

-5    0
 1    1
 3    2
dtype: int64

In [534]:
frame = DataFrame(np.arange(6).reshape(3, 2), index=[2, 0, 1])

In [535]:
frame

   0  1
2  0  1
0  2  3
1  4  5

In [536]:
frame.irow(0)

0    0
1    1
Name: 2, dtype: int64

In [537]:
frame.icol(1)

2    1
0    3
1    5
Name: 1, dtype: int64